html/Blog/Graphics/resources/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header> <a href="https://ianstranathan.github.io/">Main</a> :: <a href="https://ianstranathan.github.io/Blog/">Blog</a> ::</header></header>
</div>
<div id="content" class="content">
<div id="outline-container-org313c29c" class="outline-2">
<h2 id="org313c29c">Blog Roll; Guys to learn from &amp; be inspired by</h2>
<div class="outline-text-2" id="text-org313c29c">
<p>
<a href="https://www.glassner.com/writing/">Andrew Glassner</a>
<a href="https://www.iquilezles.org/www/index.htm">Inigo Quilez</a>
<a href="https://twitter.com/FabriceNEYRET">Fabrice Neyret</a>
<a href="https://twitter.com/The_ArtOfCode">Martijn Steinrucken</a>
<a href="https://blog.demofox.org/">Alan Wolfe</a>
<a href="https://www.willusher.io/">Will Usher</a>
Alexander Sannikov
<a href="https://twitter.com/renderwonk">Naty Hoffman</a>
<a href="http://mollyrocket.com/casey">Casey Muratori</a>
<a href="http://www.p1xelcoder.com/links/">Oliver Franzke</a>
<a href="https://erich.realtimerendering.com/">Eric Haines</a>
<a href="https://casual-effects.com/">Morgan McGuire</a>
<a href="https://twitter.com/gabrielpeyre">Gabriel Peyré</a>
<a href="https://www.petershirley.com/">Peter Shirley</a>
<a href="http://acko.net">Steven Witten</a>
<a href="https://twitter.com/programmerlin">John Lin</a>
<a href="https://twitter.com/tuxedolabs?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor">Dennis Gustafsson</a>
</p>
</div>
</div>

<div id="outline-container-org84e0726" class="outline-2">
<h2 id="org84e0726">Literature that's been helpful &amp; Misc collected resources</h2>
<div class="outline-text-2" id="text-org84e0726">
</div>
<div id="outline-container-org4af4e3b" class="outline-3">
<h3 id="org4af4e3b">General</h3>
<div class="outline-text-3" id="text-org4af4e3b">
<hr />
<p>
<a href="http://www.realtimerendering.com/">Real Time Rendering, 4th Edition</a>
<a href="https://www.glassner.com/portfolio/principles-of-digital-image-synthesis/">Principles of Digital Image Synthesis</a>
<a href="https://www.amazon.com/Fundamentals-Computer-Graphics-Steve-Marschner-dp-1482229390/dp/1482229390/ref=dp_ob_title_bk">Fundamentals of Computer Graphics, 4th Edition</a>
<a href="https://www.amazon.com/Advanced-Global-Illumination-Philip-Dutre/dp/1568813074/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1540517779&amp;sr=1-1&amp;keywords=advanced+global">Advanced Global Illumination</a>
</p>

<p>
<a href="https://graphicscodex.com/">Graphics Codex</a>
<a href="https://paroj.github.io/gltut/">Learning Modern 3D Graphics Programming</a>
<a href="https://github.com/ssloy">Tiny tutorials</a>
</p>
</div>
</div>

<div id="outline-container-org2bbdbd4" class="outline-3">
<h3 id="org2bbdbd4">Framework Resources</h3>
<div class="outline-text-3" id="text-org2bbdbd4">
</div>
<div id="outline-container-orgc657918" class="outline-4">
<h4 id="orgc657918">Vulkan</h4>
</div>

<div id="outline-container-org5eb526c" class="outline-4">
<h4 id="org5eb526c">WebGPU</h4>
<div class="outline-text-4" id="text-org5eb526c">
<p>
<a href="https://webgpufundamentals.org/">webgpufundamentals</a>
</p>
</div>
</div>

<div id="outline-container-org79947af" class="outline-4">
<h4 id="org79947af">OpenGL</h4>
<div class="outline-text-4" id="text-org79947af">
<hr />
<p>
<a href="https://learnopengl.com">LearnOpenGL</a>
</p>
</div>
</div>

<div id="outline-container-org1c56612" class="outline-4">
<h4 id="org1c56612">WebGL</h4>
<div class="outline-text-4" id="text-org1c56612">
<hr />
<p>
<a href="https://webgl2fundamentals.org/">webgl2fundamentals</a>
<a href="http://learnwebgl.brown37.net/">LearnWebGL</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org4df04c0" class="outline-3">
<h3 id="org4df04c0">Algorithms</h3>
<div class="outline-text-3" id="text-org4df04c0">
</div>
<div id="outline-container-org35c6eaa" class="outline-4">
<h4 id="org35c6eaa">Raytracing</h4>
<div class="outline-text-4" id="text-org35c6eaa">
<p>
<a href="https://www.youtube.com/playlist?list=PLujxSBD-JXgnGmsn7gEyN28P1DnRZG7qi">TU Wien</a>
</p>
</div>
</div>

<div id="outline-container-org92bc220" class="outline-4">
<h4 id="org92bc220">Raymarching</h4>
<div class="outline-text-4" id="text-org92bc220">
<p>
<a href="../raymarching">Personal Raymarching Summary</a>
</p>
</div>
</div>

<div id="outline-container-org4ffc679" class="outline-4">
<h4 id="org4ffc679">PBR</h4>
<div class="outline-text-4" id="text-org4ffc679">
<p>
<a href="https://pbrt.org/">Physically Based Rendering, 3rd Edition</a>
<a href="https://learnopengl.com/#!PBR/Theory">LearnOpenGL</a>
<a href="http://blog.selfshadow.com/publications/s2014-shading-course/frostbite/s2014_pbs_frostbite_slides.pdf">http://blog.selfshadow.com/publications/s2014-shading-course/frostbite/s2014_pbs_frostbite_slides.pdf</a>
<a href="http://renderwonk.com/publications/s2010-shading-course/hoffman/s2010_physically_based_shading_hoffman_b_notes.pdf">http://renderwonk.com/publications/s2010-shading-course/hoffman/s2010_physically_based_shading_hoffman_b_notes.pdf</a>
<a href="https://disney-animation.s3.amazonaws.com/library/s2012_pbs_disney_brdf_notes_v2.pdf">https://disney-animation.s3.amazonaws.com/library/s2012_pbs_disney_brdf_notes_v2.pdf</a>
<a href="http://blog.selfshadow.com/publications/s2013-shading-course/karis/s2013_pbs_epic_slides.pdf">http://blog.selfshadow.com/publications/s2013-shading-course/karis/s2013_pbs_epic_slides.pdf</a>
</p>
</div>
</div>
</div>


<div id="outline-container-orgbdee1a4" class="outline-3">
<h3 id="orgbdee1a4">Lectures/ Talks</h3>
<div class="outline-text-3" id="text-orgbdee1a4">
<p>
<code>=====================================================================================</code>
<a href="https://www.youtube.com/watch?v=P6UKhR0T6cs">John Carmack</a>
<a href="https://www.youtube.com/watch?v=j-A0mwsJRmk">Naty Hoffman</a>
<a href="https://www.youtube.com/watch?v=GNO_CYUjMK8">Steven Witten</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><p>©Ian Stranathan <script>document.write(new Date().getFullYear())</script></p></footer>
</div>
</body>
</html>